Kolodieiev/perfect_console/firmware/hardware_tests/src/meow/driver/graphics/TFT_eSPI/Processors/TFT_eSPI_ESP32_S3.inc
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len)
{

  volatile uint32_t *spi_w = _spi_w;
  uint32_t color32 = (color << 8 | color >> 8) << 16 | (color << 8 | color >> 8);
  uint32_t i = 0;
  uint32_t rem = len & 0x1F;
  len = len - rem;

  // Start with partial buffer pixels
  if (rem)
  {
    while (*_spi_cmd & SPI_USR)
      ;
    for (i = 0; i < rem; i += 2)
      *spi_w++ = color32;
    *_spi_mosi_dlen = (rem << 4) - 1;
#if CONFIG_IDF_TARGET_ESP32S3
    *_spi_cmd = SPI_UPDATE;
    while (*_spi_cmd & SPI_UPDATE)
      ;
#endif
    *_spi_cmd = SPI_USR;
    if (!len)
      return; //{while (*_spi_cmd&SPI_USR); return; }
    i = i >> 1;
    while (i++ < 16)
      *spi_w++ = color32;
  }

  while (*_spi_cmd & SPI_USR)
    ;
  if (!rem)
    while (i++ < 16)
      *spi_w++ = color32;
  *_spi_mosi_dlen = 511;

  // End with full buffer to maximise useful time for downstream code
  while (len)
  {
    while (*_spi_cmd & SPI_USR)
      ;
#if CONFIG_IDF_TARGET_ESP32S3
    *_spi_cmd = SPI_UPDATE;
    while (*_spi_cmd & SPI_UPDATE)
      ;
#endif
    *_spi_cmd = SPI_USR;
    len -= 32;
  }

  // Do not wait here
  // while (*_spi_cmd&SPI_USR);
}
//*/
/***************************************************************************************
** Function name:           pushSwapBytePixels - for ESP32
** Description:             Write a sequence of pixels with swapped bytes
***************************************************************************************/
void TFT_eSPI::pushSwapBytePixels(const void *data_in, uint32_t len)
{

  uint8_t *data = (uint8_t *)data_in;
  uint32_t color[16];

  if (len > 31)
  {
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
    while (len > 31)
    {
      uint32_t i = 0;
      while (i < 16)
      {
        color[i++] = DAT8TO32(data);
        data += 4;
      }
      while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
        ;
      WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), color[0]);
      WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), color[1]);
      WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), color[2]);
      WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), color[3]);
      WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), color[4]);
      WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), color[5]);
      WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), color[6]);
      WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), color[7]);
      WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), color[8]);
      WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), color[9]);
      WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), color[10]);
      WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), color[11]);
      WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), color[12]);
      WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), color[13]);
      WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), color[14]);
      WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), color[15]);
#if CONFIG_IDF_TARGET_ESP32S3
      SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
        ;
#endif
      SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      len -= 32;
    }
  }

  if (len > 15)
  {
    uint32_t i = 0;
    while (i < 8)
    {
      color[i++] = DAT8TO32(data);
      data += 4;
    }
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
      ;
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 255);
    WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), color[0]);
    WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), color[1]);
    WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), color[2]);
    WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), color[3]);
    WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), color[4]);
    WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), color[5]);
    WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), color[6]);
    WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), color[7]);
#if CONFIG_IDF_TARGET_ESP32S3
    SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
      ;
#endif
    SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
    len -= 16;
  }

  if (len)
  {
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
      ;
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
    for (uint32_t i = 0; i <= (len << 1); i += 4)
    {
      WRITE_PERI_REG(SPI_W0_REG(SPI_PORT) + i, DAT8TO32(data));
      data += 4;
    }
#if CONFIG_IDF_TARGET_ESP32S3
    SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
      ;
#endif
    SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
  }
  while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
    ;
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void *data_in, uint32_t len)
{

  if (_swapBytes)
  {
    pushSwapBytePixels(data_in, len);
    return;
  }

  uint32_t *data = (uint32_t *)data_in;

  if (len > 31)
  {
    WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
    while (len > 31)
    {
      while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
        ;
      WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), *data++);
      WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), *data++);
#if CONFIG_IDF_TARGET_ESP32S3
      SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
        ;
#endif
      SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      len -= 32;
    }
  }

