Kolodieiev/perfect_console/firmware/hardware_tests/src/meow/driver/graphics/TFT_eSPI/Processors/TFT_eSPI_ESP32_S3.inc
  if (buffer == nullptr)
  {
    buffer = image;
    dmaWait();
  }

  // If image is clipped, copy pixels into a contiguous block
  if ((dw != w) || (dh != h))
  {
    if (_swapBytes)
    {
      for (int32_t yb = 0; yb < dh; yb++)
      {
        for (int32_t xb = 0; xb < dw; xb++)
        {
          uint32_t src = xb + dx + w * (yb + dy);
          (buffer[xb + yb * dw] = image[src] << 8 | image[src] >> 8);
        }
      }
    }
    else
    {
      for (int32_t yb = 0; yb < dh; yb++)
      {
        memcpy((uint8_t *)(buffer + yb * dw), (uint8_t *)(image + dx + w * (yb + dy)), dw << 1);
      }
    }
  }
  // else, if a buffer pointer has been provided copy whole image to the buffer
  else if (buffer != image || _swapBytes)
  {
    if (_swapBytes)
    {
      for (uint32_t i = 0; i < len; ++i)
        (buffer[i] = image[i] << 8 | image[i] >> 8);
    }
    else
    {
      memcpy(buffer, image, len * 2);
    }
  }

  if (spiBusyCheck)
    dmaWait(); // In case we did not wait earlier

  setAddrWindow(x, y, dw, dh);

  // DMA byte count for transmit is 64Kbytes maximum, so to avoid this constraint
  // small transfers are performed using a blocking call until DMA capacity is reached.
  // User sketch can prevent blocking by managing pixel count and splitting into blocks
  // of 32768 pixels maximum. (equivalent to an area of ~320 x 100 pixels)
  while (len > 0x4000)
  { // Transfer 16 bit pixels in blocks if len*2 over 65536 bytes
    pushPixels(buffer, 0x400);
    len -= 0x400;
    buffer += 0x400; // Arbitrarily send 1K pixel blocks (2Kbytes)
  }

  esp_err_t ret;
  static spi_transaction_t trans;

  memset(&trans, 0, sizeof(spi_transaction_t));

  trans.user = (void *)1;
  trans.tx_buffer = buffer; // finally send the line data
  trans.length = len * 16;  // Data length, in bits
  trans.flags = 0;          // SPI_TRANS_USE_TXDATA flag

  ret = spi_device_queue_trans(dmaHAL, &trans, portMAX_DELAY);
  assert(ret == ESP_OK);

  spiBusyCheck++;
}

////////////////////////////////////////////////////////////////////////////////////////
// Processor specific DMA initialisation
////////////////////////////////////////////////////////////////////////////////////////

// The DMA functions here work with SPI only (not parallel)
/***************************************************************************************
** Function name:           dc_callback
** Description:             Toggles DC line during transaction (not used)
***************************************************************************************/
extern "C" void dc_callback();

void IRAM_ATTR dc_callback(spi_transaction_t *spi_tx)
{
  if ((bool)spi_tx->user)
  {
    DC_D;
  }
  else
  {
    DC_C;
  }
}

/***************************************************************************************
** Function name:           dma_end_callback
** Description:             Clear DMA run flag to stop retransmission loop
***************************************************************************************/
extern "C" void dma_end_callback();

void IRAM_ATTR dma_end_callback(spi_transaction_t *spi_tx)
{
  WRITE_PERI_REG(SPI_DMA_CONF_REG(spi_host), 0);
}

/***************************************************************************************
** Function name:           initDMA
** Description:             Initialise the DMA engine - returns true if init OK
***************************************************************************************/
bool TFT_eSPI::initDMA(bool ctrl_cs)
{
  if (DMA_Enabled)
    return false;

  esp_err_t ret;
  spi_bus_config_t buscfg = {
      .mosi_io_num = TFT_MOSI,
      .miso_io_num = TFT_MISO,
      .sclk_io_num = TFT_SCLK,
      .quadwp_io_num = -1,
      .quadhd_io_num = -1,
      .max_transfer_sz = 65536, // ESP32 S3 max size is 64Kbytes
      .flags = 0,
      .intr_flags = 0};

  int8_t pin = -1;
  if (ctrl_cs)
    pin = TFT_CS;

  spi_device_interface_config_t devcfg = {
      .command_bits = 0,
      .address_bits = 0,
      .dummy_bits = 0,
      .mode = TFT_SPI_MODE,
      .duty_cycle_pos = 0,
      .cs_ena_pretrans = 0,
      .cs_ena_posttrans = 0,
      .clock_speed_hz = SPI_FREQUENCY,
      .input_delay_ns = 0,
      .spics_io_num = pin,
      .flags = SPI_DEVICE_NO_DUMMY, // 0,
      .queue_size = 1,              // Not using queues
      .pre_cb = 0,                  // dc_callback, //Callback to handle D/C line (not used)
      .post_cb = dma_end_callback   // Callback to end transmission
  };
  ret = spi_bus_initialize(spi_host, &buscfg, DMA_CHANNEL);
  ESP_ERROR_CHECK(ret);
  ret = spi_bus_add_device(spi_host, &devcfg, &dmaHAL);
  ESP_ERROR_CHECK(ret);

  DMA_Enabled = true;
  spiBusyCheck = 0;
  return true;
}

/***************************************************************************************
** Function name:           deInitDMA
** Description:             Disconnect the DMA engine from SPI
***************************************************************************************/
void TFT_eSPI::deInitDMA(void) // TODO
{
  if (!DMA_Enabled)
    return;
  spi_bus_remove_device(dmaHAL);
  spi_bus_free(spi_host);
  DMA_Enabled = false;
}

////////////////////////////////////////////////////////////////////////////////////////
#endif // End of DMA FUNCTIONS
////////////////////////////////////////////////////////////////////////////////////////

#endif // defined(CONFIG_IDF_TARGET_ESP32S3) or defined(CONFIG_IDF_TARGET_ESP32S2)
